---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.ElementWorksetFilter
source: html/ac3a8392-828c-1cbf-7a37-6156fee0bde2.htm
---
# ElementWorksetFilter Members

Constructs a new instance of a filter to match elements in a given workset.